[
  "“你不需要很完美才能開始，但你需要開始才能完美。 On your own path. Keep breathing.” 國立政治大學研究及教學助理",
  "國立政治大學語言學研究所 碩士畢業 台北市文山區 3~4年工作經驗",
  "希望職稱：資料科學家 畢業於國立政治大學語言學研究所，研究興趣為台語的自然語言處理，撰寫論文期間使用 PyTorch 搭建模型，用於提取台語健康照護文本中的身體部位名稱。 樂於學習新事物，除自然語言處理技術外，對於台語語音及音韻亦有所研究，能分析語音聲紋圖，同時了解台語音韻規則及結構。",
  "我是蔡長祐，畢業於國立政治大學語言學研究所。雖然所屬科系聽起來偏人文，但我的訓練橫跨語言學理論與自然語言處理（NLP）實作，長期關注語言作為人類溝通的結構與變異，也好奇「電腦是否能理解這些語言的邏輯？」，又或者「如何讓電腦理解語言的邏輯？」 我的碩士論文聚焦於台語健康照護文本中的身體部位名稱擷取，涵蓋資料建構、標註設計、語言特徵選取與模型訓練，針對低資源語言開發命名實體辨識系統。在此基礎上，也延伸建立了一個客製化 GPT 聊天機器人，以提供標記台語身體部位名城的輔助工具，進一步拓展低資源語言在 NLP 上的應用。 在學期間，我系統性修習機器學習、深度學習與生成模型課程，也參與 KnULP 實驗室，並擔任多門 NLP 課程的教學助理，設計並帶領實作教學，內容涵蓋分類、序列標註、seq2seq 與主題模型等；同時也擔任研究助理，負責資料處理與統計，以及模型的搭建與操作。這些教學資源目前已整理為開源教材並上傳至 GitHub，供學生與其他使用者取用。",
  "我也熱衷推廣語言學在科技上的應用，曾參與「真的吧！訊息偵探事務所」專案，從語言分析出發拆解錯假訊息的書寫手法，並開發 LINE 機器人「討厭詭圖鑑」進行互動式展示，該專案於 2022 資訊月展出，吸引超過百位用戶加入。 作為一名跨領域的人，我喜歡將抽象的語言理論轉譯成具體的應用可能。程式語言冷靜理性，人類語言本身充滿迷霧與情感，而我希望成為那個在兩者之間架起橋樑的人。 I am Chang-Yu Tsai, holding an MA in Linguistics from National Chengchi University. My academic background equips me with interdisciplinary skills bridging linguistic theory and natural language processing (NLP). With a focus on the variation and structure of language, I am deeply intrigued by how to enable computers to process—or more boldly, to understand—human language.",
  "My master’s thesis focused on extracting body part names from Taiwanese healthcare texts, a task involving a low-resource language. I independently handled every stage of the project, including data preprocessing, entity labelling, linguistic feature extraction, and model training. Building upon this work, I also developed a customised GPT for automatic annotation, exploring few-shot learning in low-resource contexts. To strengthen my technical foundation, I systematically studied machine learning, deep learning, and generative AI. As a member of the KnULP Lab, I served as both a research and teaching assistant. I designed and led lab sessions covering classification, sequence labelling, seq2seq models, and topic modelling, and contributed to data analysis in lab projects. The programming materials I developed are available as open-source resources on my GitHub. Beyond academia, I actively collaborated with various institutions. I joined a team project that developed a LINE chatbot designed to reveal linguistic cues in misinformation. The project was showcased at the 2022 Taiwan IT Month and attracted over 100 users during the exhibition.",
  "As a cross-disciplinary explorer, I find joy in interpreting abstract linguistic theories into real-world applications. Programming languages may speak in logic and structure, while human language is rich with ambiguity and emotion. I aspire to be the bridge that connects these two worlds."
]